Lecture 4:String and Cell
	1.字符串数组的构建与寻访
		1.字符串数组构建
			t='How about this character string?'
			>>size(t)
			ans=1 32
			>>whos
			
			
			Tips:
				1.用单引号引起来的内容被视作字符串数组，包括空格
				2.单引号必须是英文状态
		2.字符串数组与数值数组的转换
			>> t='ABCabc'
			t =
				ABCabc
			>> abs(t)
			ans =
				65    66    67    97    98    99
			>> shu=ans
			shu =
				65    66    67    97    98    99
			>> char(shu)
			ans =
				ABCabc
			*大小写的转换：
				1.加减32
				2.upper(),lower()方法
		3.字符串数组的寻访
			u=t(14:22)
		4.字符串的拼接
			char()会把多个字符串拼接成多行数组
			
			其他函数
			+---------------------------------------------------+
			|str2mat	|字符串转换成一个文本矩阵(和char()一样)	|
			|---------------------------------------------------|
			|int2str	|整数转换成字符串						|
			|---------------------------------------------------|
			|str2num	|字符串转换成数字						|
			|---------------------------------------------------|
			|num2str	|数字转换成字符串						|
			|---------------------------------------------------|
			|setstr		|ASCII码转换成字符串(和char()一样)		|
			|---------------------------------------------------|
			|sprintf	|用格式控制，数字转换成字符串			|
			|---------------------------------------------------|
			|fprintf	|把格式化的文本写到文件中或显示屏上		|
			|---------------------------------------------------|
			|lower		|字符串转换成小写						|
			|---------------------------------------------------|
			|upper		|字符串转换成大写						|
			+---------------------------------------------------+
			
			例子：
				>> rad=45;area=13;
				>> t=sprintf('A circle of radius %.4g has an area of %.4g',rad,area)
				t =
					A circle of radius 45 has an area of 13
				>> fprintf('A circle of radius %.4g has an area of %.4g',rad,area)
					A circle of radius 45 has an area of 13>> 
				>> fprintf('A circle of radius %.4g has an area of %.4g\n',rad,area)
					A circle of radius 45 has an area of 13
				>>
	2.字符串函数
		+---------------------------------------------------+
		|eval		|作为一个MATLAB命令求字符串的值			|
		|---------------------------------------------------|
		|feval		|求由字符串给定的函数值					|
		|---------------------------------------------------|
		|deblank	|去掉字符串中后拖的空格					|
		|---------------------------------------------------|
		|blanks(n)	|返回一个N个零或空格的字符串			|
		|---------------------------------------------------|
		|findstr	|从一个字符串内找出字符串				|
		|---------------------------------------------------|
		|isletter	|字母存在时返回真值						|
		|---------------------------------------------------|
		|isspace	|空格字符存在时返回真值					|
		|---------------------------------------------------|
		|isstr		|输入是一个字符串，返回真值				|
		|---------------------------------------------------|
		|lasterr	|返回上一个所产生MATLAB错误的字符串		|
		|---------------------------------------------------|
		|strcmp		|字符串相同，返回真值					|
		|---------------------------------------------------|
		|strrep		|用一个字符串替换另一个字符串			|
		|---------------------------------------------------|
		|strtok		|在一个字符串中找出第一个标记(默认空格)	|
		+---------------------------------------------------+
		
		*findstr默认是以单下标数组返回字符的位置
			>>b='Peter Piper picked a peck of pickied peppers'
			>>findstr(b,' ')
				ans =
					6    12    19    21    26    29    37
		*find可以用逻辑数组返回下标，例：find(b=='p')
			>>find(b=='p')
				ans =
					9    13    22    30    38    40    41
		*>>strrep(b,'p','P')
			ans =
				Peter PiPer Picked a Peck of Pickied PePPers
		*>>strtok(b)
			ans =
				Peter
		*>>[c,r]=strtok(b)
			c =
				Peter
			r =
				Piper picked a peck of pickied peppers
		*>> strtok(b,'a')
			ans =
				Peter Piper picked
				
	3.元胞数组
		Tips:
			1.元胞数组是MATLAB种特有的一种数据类型，是数组的一种，其内部元素可以是属于不同的数据类型
			2.数组元素位和数组元素内容的区别
			3.元胞位元素类型可不同，元素个数也可不同，但底层要满足一般数组的要求
		1.按元素位创建
			A(1,1)={[1 2 3;4 5 6;7 8 9]}
			A(1,2)={2+3i}
			A(2,1)={'A character atring'}
			A(2,2)={12:-2:0}
		2.按元素内容创建
			A{1,1}=[1 2 3;4 5 6;7 8 9]
			A{1,2}=2+3i
			A{2,1}='A character atring'
			A{2,2}=12:-2:0
		3.按址寻访
			A(1,1)
			ans = 
				[3x3 double]
		4.按值寻访
			A{1,1}
			ans =
				1     2     3
				4     5     6
				7     8     9
		5.元胞数组的显示：
			1.回车法
				>>A
				A = 
					[3x3 double]    [2.0000 + 3.0000i]
					'A character atring'          [1x7 double]
				
			2.内容显示法
				>>celldisp(A)
		6.元胞的赋值
			C=cell(2,3)
			C{1,1}='This works'
		7.元胞的组合
			C=[A;B]	(A,B都是元胞数组，且列数相同)
		8.元胞数组的位引用
			D=C([1 3],:)
			C(3,:)=[]	//清除C元胞的第三行
		9.元胞数组的值引用
			>>x=B{2,2}
			x=5
			>>class(x)
			ans=double
			
			>>y=B(2,2)
			y=[5]
			>>class(y)
			ans=cell
			
			>>d=C{:,2}	//不同版本结果不同，不推荐使用本语法
			d =
				2.0000 + 3.0000i
			[d,e,f,g]=C{:,2}
			>> D=C(:,2)
			D = 
				[2.0000 + 3.0000i]
				[1x7 double]
				[2.0000 + 3.0000i]
				[1x7 double]
			>> A{1,1}
			ans =

				1     2     3
				4     5     6
				7     8     9
				
			>> A{1,1}(3,:)
			ans =
				7     8     9
				